import avatarMen1 from '@/shared/assets/images/avatar-men-1.webp';
import avatarMen2 from '@/shared/assets/images/avatar-men-2.webp';
import avatarWomen1 from '@/shared/assets/images/avatar-women-1.webp';
import avatarWomen2 from '@/shared/assets/images/avatar-women-2.webp';
import avatarWomen3 from '@/shared/assets/images/avatar-women-3.webp';
import avatarWomen4 from '@/shared/assets/images/avatar-women-4.webp';

export const REVIEWS = [
  {
    id: 1,
    date: '01.04.2023',
    name: 'Сергей Петров',
    avatar: avatarMen1,
    review:
      'Провел потрясающий отдых в глэмпинге на природе. Домики были комфортабельными и стильно оформленными, с современными удобствами. Персонал оказался гостеприимным и отзывчивым, всегда готовым помочь. Особенно запомнились прогулки по живописным тропам, рыбалка и вечерние барбекю у костра. Это идеальное место для тех, кто хочет сочетать комфорт и природное окружение. Я получил массу положительных эмоций и обязательно вернусь сюда снова!',
  },
  {
    id: 2,
    date: '01.10.2025',
    name: 'Анна Иванова',
    avatar: avatarWomen1,
    review:
      'Мой отдых в глэмпинге оказался просто незабываемым! Домики были невероятно уютными и комфортабельными, современными и оснащенными всем необходимым для приятного проживания. Персонал проявил исключительное дружелюбие и готовность помочь в любых вопросах и пожеланиях, что сделало наше пребывание еще более приятным. Особенно хотелось бы отметить разнообразные развлечения, которые сделали наш отдых активным и насыщенным: мы с удовольствием занимались рыбалкой, совершали прогулки на велосипедах и устраивали барбекю на свежем воздухе.',
  },
  {
    id: 3,
    date: '08.05.2024',
    name: 'Екатерина Смирнова',
    avatar: avatarWomen2,
    review:
      'Недавно зависала в глэмпинге и это было просто вау! Домики стильные и уютные, как будто в инстаграмном блоге у кого-то крутого. Персонал — милахи, всегда на позитиве. Прогулки по лесу — огонь, особенно когда натыкаешься на идеальное местечко для фото. Вечера у костра — это вообще отдельная история, такая атмосфера! Барбекю просто тает во рту. Короче, если хочешь совместить уют и природу, тебе сюда. Зарядилась энергией по максимуму, уже планирую следующий визит!',
  },
  {
    id: 4,
    date: '31.01.2025',
    name: 'Виктория Федорова',
    avatar: avatarWomen3,
    review:
      'Недавно провела чудесный отпуск в глэмпинге на природе. Домики уютные, с современным комфортом. Персонал очень гостеприимный и отзывчивый. Особенно понравились прогулки по лесу и вечера у костра с барбекю. Идеальное место для тех, кто хочет насладиться природой и комфортом. Масса положительных эмоций, обязательно вернусь снова!',
  },
  {
    id: 5,
    date: '09.06.2023',
    name: 'Дмитрий Новиков',
    avatar: avatarMen2,
    review:
      'Недавно отдыхал в глэмпинге и остался в полном восторге! Домики уютные и комфортабельные, с современным дизайном. Персонал дружелюбный и всегда готов помочь. Особенно понравились прогулки по лесу, рыбалка и вечерние барбекю. Это идеальное место, чтобы насладиться природой и комфортом. Получил массу положительных эмоций и с нетерпением жду следующего визита!',
  },
  {
    id: 6,
    date: '15.10.2025',
    name: 'Ольга Зайцева',
    avatar: avatarWomen4,
    review:
      'Я провела незабываемый отдых в глэмпинге ! Домик был очень уютным и комфортабельным, современным и со всем необходимым для приятного проживания. Персонал был очень дружелюбным и готовым помочь нам в любых вопросах и пожеланиях. Мы также наслаждались разнообразными развлечениями, такими как рыбалка, прогулки на велосипедах и барбекю. Я очень рекомендую глэмпинг в Техногородке для тех, кто хочет насладиться природой и комфортом. Это был незабываемый отдых, и я обязательно вернусь сюда еще раз!',
  },
];
