import {
  BakeryDiningIcon,
  BedrumBabyIcon,
  CottageIcon,
  FireplaceIcon,
  HotTubIcon,
  MedicalServiceIcon,
  NatureIcon,
  NestEcoLeafIcon,
  SaitingIcon,
  SavingsIcon,
  ScheduleIcon,
  SunnyIcon,
  SupportAgentIcon,
  WaterIcon,
} from '@/shared/ui/icons';

export const LIST_ABOUT_SECTION = [
  {
    id: 1,
    title: 'Наш глэмпинг курорт расположен в тишине вдали от городской суеты',
    icon: <NatureIcon />,
  },
  {
    id: 2,
    title:
      'Наши менеджеры всегда на связи с вами, чтобы ответить на любые вопросы',
    icon: <SupportAgentIcon />,
  },

  {
    id: 3,
    title:
      'Море зеленой травы и чистые озера - летом, бескрайние поля, чистейший белоснежный снег- зимой',
    icon: <SunnyIcon />,
  },
  {
    id: 4,
    title: 'Можно заказать еду: завтрак, обед, ужин на территории глемпинга',
    icon: <BakeryDiningIcon />,
  },
  {
    id: 5,
    title:
      'Террирория глемпинга оборудована камерами видеонаблюдения, заборами, а также в каждом домике расположена мед аптечка',
    icon: <MedicalServiceIcon />,
  },
  {
    id: 6,
    title:
      '45 минут езды по трассе м7 «волга» от центра города Казани и вы попадаете в совершенно неповторимую атмосферу сельской жизни',
    icon: <ScheduleIcon />,
  },
  {
    id: 7,
    title:
      'Вас ждут отдельно стоящие домики новой постройки, со стильным дизайном, которые оснащены всем необходимым для комфортного отдыха',
    icon: <CottageIcon />,
  },

  {
    id: 8,
    title:
      'Мы придерживаемся политики демократичных и оправданных цен на проживание в наших гостевых домах и конечно же не забываем радовать гостей акциями и скидками на проживание',
    icon: <SavingsIcon />,
  },
  {
    id: 9,
    title:
      'По вашему желанию можно арендовать баню, чтобы более сделать прекрасным ваш отдых',
    icon: <HotTubIcon />,
  },
  {
    id: 10,
    title:
      'Интересный и разнообразный отдых: вы сможете спокойно насладиться природой или заняться активным отдыхом',
    icon: <SaitingIcon />,
  },
  {
    id: 11,
    title: 'Домики на берегу озера',
    icon: <WaterIcon />,
  },

  {
    id: 12,
    title: 'Комфорт и тепло в домике в любой сезон',
    icon: <FireplaceIcon />,
  },
  {
    id: 13,
    title:
      'Планируется также построение детской площадки и зоны совместного отдыха (до 15 человек)',
    icon: <BedrumBabyIcon />,
  },
  {
    id: 14,
    title: 'Экологически чистое место, в 50км нет ни заводов ни фабрик',
    icon: <NestEcoLeafIcon />,
  },
];
